---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ModelNurbSpline
source: html/5c759572-bab9-4e3d-c66d-982e9bf73b7f.htm
---
# ModelNurbSpline Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.